FloThinksPi/PhotoPainter-ESP32/src/fetcher.cpp
    // Send address offset (4 bytes, big endian)
    Wire.write((address_offset >> 24) & 0xFF);
    Wire.write((address_offset >> 16) & 0xFF); 
    Wire.write((address_offset >> 8) & 0xFF);
    Wire.write(address_offset & 0xFF);
    
    // Send data size (4 bytes, big endian)  
    Wire.write((data_size >> 24) & 0xFF);
    Wire.write((data_size >> 16) & 0xFF);
    Wire.write((data_size >> 8) & 0xFF);
    Wire.write(data_size & 0xFF);
    
    // Send chunk data
    size_t written = Wire.write(data, data_size);
    
    // Verify all data was queued for transmission
    if (written != data_size) {
      if (attempt >= 1) { // Log after 2 attempts (faster feedback)
        Serial.printf("✗ Buffer overflow: only %d of %d bytes queued for address 0x%08X (attempt %d)\n", 
                      written, data_size, address_offset, attempt + 1);
      }
      Wire.endTransmission(); // Clean up
      errorCount++;
      continue; // Retry with minimal delay
    }
    
    uint8_t error = Wire.endTransmission();
    
    if (error == 0) {
      lastI2CActivity = millis();
      i2cTransactionCount++;
      unsigned long chunk_time = millis() - chunk_start;
      // Log timing only for slow transfers (> 50ms) to avoid spam
      if (chunk_time > 50) {
        Serial.printf("⏱️ Slow I2C chunk (addr 0x%08X): %lu ms\n", address_offset, chunk_time);
      }
      return true; // Success!
    } else {
      if (attempt >= 1) { // Log after 2 attempts (faster feedback)
        Serial.printf("✗ Failed to send chunk to address 0x%08X (attempt %d, error: %d)\n", 
                      address_offset, attempt + 1, error);
        if (error == 5) {
          Serial.println("   → I2C timeout - slave may be busy processing data");
        }
      }
      errorCount++;
    }
  }
  
  unsigned long chunk_time = millis() - chunk_start;
  Serial.printf("✗ Failed to send chunk to address 0x%08X after %d attempts (took %lu ms)\n", address_offset, 3, chunk_time);
  return false; // All attempts failed
}

// Send render command to Pi Pico slave
bool sendRenderCommand() {
  Wire.beginTransmission(PI_PICO_I2C_ADDRESS);
  Wire.write(CMD_RENDER_IMAGE);
  uint8_t error = Wire.endTransmission();
  
  if (error == 0) {
    Serial.println("✓ Render command sent");
    lastI2CActivity = millis();
    display_cycle_count++; // Increment display cycle counter
    Serial.printf("Display cycle count: %d\n", display_cycle_count);
    saveBatteryData(); // Save updated cycle count
    return true;
  } else {
    Serial.printf("✗ Failed to send render command (error: %d)\n", error);
    errorCount++;
    return false;
  }
}

// Send BMP reorder and render command to Pi Pico slave
bool sendBmpRenderCommand() {
  Wire.beginTransmission(PI_PICO_I2C_ADDRESS);
  Wire.write(CMD_RENDER_BMP_ORDER);
  uint8_t error = Wire.endTransmission();
  
  if (error == 0) {
    Serial.println("✓ BMP reorder and render command sent");
    lastI2CActivity = millis();
    display_cycle_count++; // Increment display cycle counter  
    Serial.printf("Display cycle count: %d\n", display_cycle_count);
    saveBatteryData(); // Save updated cycle count
    return true;
  } else {
    Serial.printf("✗ Failed to send BMP render command (error: %d)\n", error);
    errorCount++;
    return false;
  }
}

// Test I2C communication with Pi Pico
bool testI2CConnection() {
  Serial.println("=== TESTING I2C CONNECTION ===");
  
  // Test 1: Simple address check
  Wire.beginTransmission(PI_PICO_I2C_ADDRESS);
  uint8_t error = Wire.endTransmission();
  
  if (error != 0) {
    Serial.printf("✗ Basic I2C test failed (error: %d)\n", error);
    if (error == 2) {
      Serial.println("  → Address NACK - Pi Pico not responding at 0x42");
      Serial.println("  → Check: Pi Pico powered? I2C slave code running?");
    } else if (error == 5) {
      Serial.println("  → Timeout - Check I2C wiring and connections");
    }
    return false;
  }
  
  Serial.println("✓ Basic I2C address test passed");
  
  // Test 2: Try to get status (simple read test)
  Serial.println("Testing status read...");
  Wire.beginTransmission(PI_PICO_I2C_ADDRESS);
  Wire.write(CMD_GET_STATUS);
  error = Wire.endTransmission();
  
  if (error != 0) {
    Serial.printf("✗ Status command failed (error: %d)\n", error);
    return false;
  }
  
  // Request response
  Wire.requestFrom(PI_PICO_I2C_ADDRESS, 1);
  
  if (Wire.available()) {
    uint8_t status = Wire.read();
    Serial.printf("✓ Pi Pico status read successful: 0x%02X\n", status);
    return true;
  } else {
    Serial.println("✗ No status response - Pi Pico may not have I2C slave code running");
    return false;
  }
}

// Get status from Pi Pico slave
uint8_t getSlaveStatus() {
  Wire.beginTransmission(PI_PICO_I2C_ADDRESS);
  Wire.write(CMD_GET_STATUS);
  uint8_t error = Wire.endTransmission();
  
  if (error != 0) {
    Serial.printf("✗ Failed to send status request (error: %d)\n", error);
    return STATUS_ERROR;
  }
  
  // Request 1 byte response
  Wire.requestFrom(PI_PICO_I2C_ADDRESS, 1);
  
  if (Wire.available()) {
    uint8_t status = Wire.read();
    lastI2CActivity = millis();
    return status;
  } else {
    Serial.println("✗ No status response from slave");
    return STATUS_ERROR;
  }
}

// Wait for renderer to complete and confirm render status
bool waitForRenderCompletion(uint32_t timeout_ms = 30000) {
  Serial.println("Waiting for renderer to be ready for rendering...");
  unsigned long start_time = millis();
  
  while ((millis() - start_time) < timeout_ms) {
    uint8_t status = getSlaveStatus();
    
    if (status == STATUS_READY) {
      Serial.println("✓ Renderer completed successfully - display updated!");
      return true;
    } else if (status == STATUS_ERROR) {
      Serial.println("✗ Renderer reported error during rendering");
      return false;
    } else if (status == STATUS_READY_TO_RENDER) {
      Serial.println("✓ PERFECT TIMING: Renderer has all data and is ready to render!");
      Serial.println("🔋 ESP32 job complete - shutting down for maximum power savings!");
      return true; // ESP32 can shut down now - Pi Pico will handle the rest
    } else if (status == STATUS_RECEIVING) {
      Serial.printf("Renderer receiving data... (status: 0x%02X)\n", status);
    } else {
      Serial.printf("Unknown renderer status: 0x%02X\n", status);
    }
    
    delay(1000); // Check every second
  }
  
  Serial.printf("✗ Timeout waiting for renderer completion after %d seconds\n", timeout_ms / 1000);
  return false;
}

// Shut down ESP32 for maximum power savings
void shutdownESP32() {
  Serial.println("=== POWER SHUTDOWN SEQUENCE ===");
  Serial.println("✓ Image transfer and rendering completed successfully");
  Serial.println("💤 Shutting down ESP32 to save battery power...");
  Serial.println("Device will remain off until manually reset or power cycled");
  Serial.println("=====================================");
  
