FloThinksPi/PhotoPainter-ESP32/src/fetcher.cpp
  // Give time for serial output to complete
  Serial.flush();
  delay(100);
  
  // ESP32 WIFI SHUTDOWN: Use optimized shutdown mode for deep sleep
  setWiFiShutdownMode();
  
  // Put ESP32 into deep sleep mode (lowest power consumption)
  // Note: ESP32 will stay in deep sleep until reset button is pressed
  // or power is cycled, as we're not setting a wake-up timer
  esp_deep_sleep_start();
}

// Send complete image to Pi Pico slave
bool sendCompleteImage() {
  // Determine image source and size
  const uint8_t* image_data;
  size_t image_size;
  
  if (download_success && downloaded_image && downloaded_size > 0) {
    image_data = downloaded_image;
    image_size = downloaded_size;
    Serial.printf("Using downloaded image: %d bytes\n", image_size);
  } else {
    image_data = Image7color;
    image_size = sizeof(Image7color);
    Serial.printf("Using static image: %d bytes\n", image_size);
  }
  
  uint32_t totalChunks = (image_size + I2C_CHUNK_SIZE - 1) / I2C_CHUNK_SIZE;
  Serial.printf("Starting image transfer: %d bytes in %d chunks\n", image_size, totalChunks);
  
  // Reset chunk counter
  currentChunk = 0;
  
  // Send all chunks at maximum speed
  unsigned long transfer_start = millis();
  for (uint32_t chunk = 0; chunk < totalChunks; chunk++) {
    uint32_t offset = chunk * I2C_CHUNK_SIZE;
    size_t remaining = image_size - offset;
    size_t chunk_size = (remaining > I2C_CHUNK_SIZE) ? I2C_CHUNK_SIZE : remaining;
    
    if (!sendImageChunk(chunk, &image_data[offset], chunk_size)) {
      Serial.printf("✗ Failed to send chunk %d after retries\n", chunk);
      return false;
    }
    
    // Optimized progress reporting - every 200 chunks or at completion for speed
    if (chunk % 200 == 0 || chunk == totalChunks - 1) {
      float percent = ((float)(chunk + 1) / totalChunks) * 100.0;
      uint32_t bytes_sent = (chunk + 1) * I2C_CHUNK_SIZE;
      if (bytes_sent > image_size) bytes_sent = image_size;
      unsigned long elapsed = millis() - transfer_start;
      float kbps = elapsed > 0 ? (bytes_sent / (float)elapsed) : 0;
      
      Serial.printf("📊 Progress: %d/%d chunks (%.1f%%) - %d/%d bytes (%.1f KB/s)\n", 
                    chunk + 1, totalChunks, percent, bytes_sent, image_size, kbps);
    }
  }
  
  // Send render command
  if (!sendRenderCommand()) {
    return false;
  }
  
  Serial.println("✓ Complete image sent and render command issued");
  return true;
}

bool initI2C() {
  Serial.println("Initializing I2C master communication...");
  
  printI2CConfiguration();

  Serial.println("ESP32 PERFORMANCE: Instant I2C bus initialization...");
  
  Serial.printf("🚀 ESP32 I2C Performance Mode: SDA=%d, SCL=%d\n", I2C_SDA_PIN, I2C_SCL_PIN);
  
  // ESP32 MAXIMUM PERFORMANCE: Initialize I2C with breakthrough optimizations
  Wire.begin(I2C_SDA_PIN, I2C_SCL_PIN);
  
  #ifdef ESP32_PERFORMANCE_OPTIMIZED
  // ESP32-SPECIFIC: Set maximum I2C clock with hardware optimization
  Wire.setClock(I2C_CLOCK_SPEED); // 2MHz for ESP32 breakthrough performance
  
  // Initialize performance tracking with ESP32 high-precision timers
  total_bytes_transferred = 0;
  total_i2c_time_us = 0;
  
  Serial.printf("🚀 ESP32 BREAKTHROUGH: %.1f MHz I2C @ 240MHz CPU\n", 
                I2C_CLOCK_SPEED / 1000000.0);
  #else
  Wire.setClock(1500000); // Fallback to 1.5MHz for compatibility
  Serial.println("⚡ I2C Performance Mode: 1.5MHz (compatibility)");
  #endif
  
  Wire.setTimeout(8000); // Optimal timeout for reliable transfers

  Serial.println("✅ ESP32 I2C Performance initialization complete");
  
  #ifdef ESP32_PERFORMANCE_OPTIMIZED
  Serial.printf("🎯 OPTIMIZED config: SDA=%d, SCL=%d, Clock=%.1fMHz, CPU=240MHz, DMA-ready\n", 
                I2C_SDA_PIN, I2C_SCL_PIN, I2C_CLOCK_SPEED / 1000000.0);
  #else
  Serial.printf("⚡ OPTIMIZED config: SDA=%d, SCL=%d, Clock=1.5MHz, Timeout=8s\n", 
                I2C_SDA_PIN, I2C_SCL_PIN);
  #endif
  
  Serial.printf("📡 Communicating with Pi Pico slave at address 0x%02X\n", PI_PICO_I2C_ADDRESS);
  Serial.println("🔌 Physical connections:");
  Serial.println("  ESP32 pin 21 (SDA) ↔ Pi Pico pin 4 (SDA)");
  Serial.println("  ESP32 pin 22 (SCL) ↔ Pi Pico pin 5 (SCL)");
  
  // Reset connection variables
  lastI2CActivity = 0;
  i2cTransactionCount = 0;
  errorCount = 0;
  currentChunk = 0;
  
  return true;
}

// ========================================
// ESP32 WiFi Power Management for Download Optimization
// ========================================

// Set WiFi to low power mode for energy-efficient boot/connection
void setWiFiLowPowerMode() {
  Serial.println("📶 Setting WiFi to LOW POWER mode for energy-efficient boot");
  
  // ESP32 low power WiFi settings
  WiFi.setSleep(WIFI_PS_MAX_MODEM); // Maximum power saving
  WiFi.setTxPower(WIFI_POWER_2dBm); // Minimum transmission power (2dBm)
  
  // Reduce WiFi beacon interval monitoring for power saving
  esp_wifi_set_ps(WIFI_PS_MAX_MODEM);
  
  Serial.println("✅ WiFi LOW POWER mode active:");
  Serial.println("   • Power Save: MAX_MODEM (aggressive power saving)");
  Serial.println("   • TX Power: 2dBm (minimum power consumption)");
  Serial.println("   • Optimized for: Boot/Connection phase energy efficiency");
}

// Switch WiFi to high performance mode for fast downloads
void setWiFiPerformanceMode() {
  Serial.println("🚀 Switching WiFi to HIGH PERFORMANCE mode for fast downloads");
  
  // ESP32 high performance WiFi settings
  WiFi.setSleep(WIFI_PS_NONE); // Disable power saving completely
  WiFi.setTxPower(WIFI_POWER_19_5dBm); // Maximum transmission power (19.5dBm)
  
  // Disable power saving for maximum throughput
  esp_wifi_set_ps(WIFI_PS_NONE);
  
  Serial.println("✅ WiFi HIGH PERFORMANCE mode active:");
  Serial.println("   • Power Save: DISABLED (maximum performance)");
  Serial.println("   • TX Power: 19.5dBm (maximum signal strength)");
  Serial.println("   • Optimized for: Fast HTTP downloads and data transfer");
}

// Shutdown WiFi completely for deep sleep
void setWiFiShutdownMode() {
  Serial.println("💤 Setting WiFi to SHUTDOWN mode for deep sleep");
  
  // Complete WiFi shutdown for deep sleep
  WiFi.disconnect(true);
  WiFi.mode(WIFI_OFF);
  
