FloThinksPi/PhotoPainter-ESP32/src/fetcher.cpp
  Serial.println("✅ WiFi SHUTDOWN mode active:");
  Serial.println("   • WiFi completely disabled");
  Serial.println("   • Optimized for: Deep sleep power consumption");
}

// ESP32 Model Detection and Information Display
void printESP32ModelInfo() {
  esp_chip_info_t chip_info;
  esp_chip_info(&chip_info);
  
  Serial.println("\n📱 === ESP32 HARDWARE INFORMATION ===");
  
  // Determine ESP32 model
  String model = "Unknown ESP32";
  switch(chip_info.model) {
    case CHIP_ESP32:
      model = "ESP32";
      break;
    #if defined(CONFIG_IDF_TARGET_ESP32S2) || defined(ESP32S2)
    case CHIP_ESP32S2:
      model = "ESP32-S2";
      break;
    #endif
    #if defined(CONFIG_IDF_TARGET_ESP32S3) || defined(ESP32S3)  
    case CHIP_ESP32S3:
      model = "ESP32-S3";
      break;
    #endif
    #if defined(CONFIG_IDF_TARGET_ESP32C3) || defined(ESP32C3)
    case CHIP_ESP32C3:
      model = "ESP32-C3";
      break;
    #endif
    #if defined(CONFIG_IDF_TARGET_ESP32C6) || defined(ESP32C6)
    case CHIP_ESP32C6:
      model = "ESP32-C6";
      break;
    #endif
    #if defined(CONFIG_IDF_TARGET_ESP32H2) || defined(ESP32H2)
    case CHIP_ESP32H2:
      model = "ESP32-H2";
      break;
    #endif
    default:
      model = "ESP32 (Unknown Variant)";
      break;
  }
  
  Serial.printf("🔧 Model: %s\n", model.c_str());
  Serial.printf("📊 CPU Cores: %d\n", chip_info.cores);
  Serial.printf("🏷️  Chip Revision: %d\n", chip_info.revision);
  Serial.printf("⚡ CPU Frequency: %d MHz\n", getCpuFrequencyMhz());
  
  // Flash information
  uint32_t flash_size = 0;
  esp_flash_get_size(NULL, &flash_size);
  Serial.printf("💾 Flash Size: %.1f MB\n", flash_size / (1024.0 * 1024.0));
  
  // Memory information
  Serial.printf("🧠 Total Heap: %d bytes (%.1f KB)\n", ESP.getHeapSize(), ESP.getHeapSize() / 1024.0);
  Serial.printf("🆓 Free Heap: %d bytes (%.1f KB)\n", ESP.getFreeHeap(), ESP.getFreeHeap() / 1024.0);
  
  // Features
  Serial.println("🔧 Features:");
  if (chip_info.features & CHIP_FEATURE_WIFI_BGN) {
    Serial.println("   • WiFi 2.4GHz (802.11 b/g/n)");
  }
  if (chip_info.features & CHIP_FEATURE_BT) {
    Serial.println("   • Bluetooth Classic");
  }
  if (chip_info.features & CHIP_FEATURE_BLE) {
    Serial.println("   • Bluetooth Low Energy (BLE)");
  }
  if (chip_info.features & CHIP_FEATURE_EMB_FLASH) {
    Serial.println("   • Embedded Flash Memory");
  }
  if (chip_info.features & CHIP_FEATURE_EMB_PSRAM) {
    Serial.println("   • Embedded PSRAM");
  }
  
  Serial.printf("🌡️  Chip Temperature: %.1f°C\n", temperatureRead());
  Serial.println("======================================\n");
}

// Get battery voltage from Pi Pico with retry logic
float getBatteryVoltage() {
  Serial.println("Requesting battery voltage from Pi Pico...");
  unsigned long battery_start = millis();
  
  // Try multiple times in case Pi Pico is busy
  for (int attempt = 1; attempt <= 3; attempt++) {
    Serial.printf("Battery voltage attempt %d/3\n", attempt);
    
    Wire.beginTransmission(PI_PICO_I2C_ADDRESS);
    Wire.write(CMD_GET_BATTERY);
    uint8_t error = Wire.endTransmission();
    
    if (error != 0) {
      Serial.printf("Failed to send battery command, error: %d", error);
      if (error == 2) {
        Serial.println(" (NACK on address - Pi Pico not responding)");
      } else if (error == 5) {
        Serial.println(" (Timeout - Pi Pico may be busy)");
      } else {
        Serial.printf(" (Unknown I2C error)\n");
      }
      
      if (attempt < 3) {
        Serial.printf("Waiting 200ms before retry...\n");
        delay(200); // Wait longer between retries
        continue;
      }
      unsigned long battery_time = millis() - battery_start;
      Serial.printf("⏱️ Battery voltage failed after: %lu ms\n", battery_time);
      return -1.0f;
    }
    
    // Wait longer for Pi Pico to prepare response, especially if it's processing images
    delay(100); // Increased from 50ms to 100ms
    
    Wire.requestFrom(PI_PICO_I2C_ADDRESS, 4);
    
    // Wait up to 500ms for response
    unsigned long start = millis();
    while (Wire.available() < 4 && (millis() - start) < 500) {
      delay(10);
    }
    
    if (Wire.available() >= 4) {
      float voltage;
      uint8_t* voltage_bytes = (uint8_t*)&voltage;
      for (int i = 0; i < 4; i++) {
        voltage_bytes[i] = Wire.read();
      }
      
      // Validate voltage reading (should be between 2.5V and 5.0V)
      if (voltage >= 2.5f && voltage <= 5.0f) {
        unsigned long battery_time = millis() - battery_start;
        Serial.printf("✓ Battery voltage: %.3f V (attempt %d) - took %lu ms\n", voltage, attempt, battery_time);
        return voltage;
      } else {
        Serial.printf("✗ Invalid battery voltage: %.3f V (attempt %d)\n", voltage, attempt);
        if (attempt < 3) {
          delay(200);
          continue;
        }
      }
    } else {
      Serial.printf("Failed to read battery voltage response (got %d bytes, attempt %d)\n", 
                   Wire.available(), attempt);
      if (attempt < 3) {
        delay(200);
        continue;
      }
    }
  }
  
  unsigned long battery_time = millis() - battery_start;
  Serial.printf("✗ All battery voltage attempts failed - Pi Pico may be unresponsive (took %lu ms)\n", battery_time);
  return -1.0f;
}

// Send battery information to Pi Pico for display overlay
bool sendBatteryInfoToDisplay(float voltage, uint32_t cycles) {
  Serial.printf("Sending battery info to display: %.2fV, %d cycles\n", voltage, cycles);
  
  Wire.beginTransmission(PI_PICO_I2C_ADDRESS);
  Wire.write(CMD_SET_BATTERY_INFO);
  
  // Send voltage as 4-byte float
  uint8_t* voltage_bytes = (uint8_t*)&voltage;
  for (int i = 0; i < 4; i++) {
    Wire.write(voltage_bytes[i]);
  }
  
  // Send cycles as 4-byte uint32_t
  uint8_t* cycle_bytes = (uint8_t*)&cycles;
  for (int i = 0; i < 4; i++) {
    Wire.write(cycle_bytes[i]);
  }
  
  uint8_t error = Wire.endTransmission();
  
  if (error == 0) {
    Serial.println("✓ Battery info sent to display");
    return true;
  } else {
    Serial.printf("✗ Failed to send battery info, error: %d\n", error);
    return false;
  }
}

// Get RTC wakeup interval from Pi Pico (in minutes)
uint32_t getWakeupInterval() {
  Serial.println("Requesting wakeup interval from Pi Pico...");
  
  Wire.beginTransmission(PI_PICO_I2C_ADDRESS);
  Wire.write(CMD_GET_WAKEUP);
  uint8_t error = Wire.endTransmission();
  
  if (error != 0) {
    Serial.printf("Failed to send wakeup get command, error: %d\n", error);
    return 0;
  }
  
  delay(50); // Give Pi Pico time to prepare response
  
  Wire.requestFrom(PI_PICO_I2C_ADDRESS, 4);
  if (Wire.available() >= 4) {
    uint32_t interval;
    uint8_t* interval_bytes = (uint8_t*)&interval;
    for (int i = 0; i < 4; i++) {
      interval_bytes[i] = Wire.read();
    }
    Serial.printf("✓ Current wakeup interval: %lu minutes\n", interval);
    return interval;
  } else {
    Serial.printf("Failed to read wakeup interval response\n");
    return 0;
  }
}

// Set RTC wakeup interval on Pi Pico (in minutes)
bool setWakeupInterval(uint32_t minutes) {
  Serial.printf("Setting wakeup interval to %lu minutes...\n", minutes);
  
  if (minutes < 1 || minutes > 43800) {
    Serial.printf("Invalid wakeup interval: %lu (must be 1-43800 minutes)\n", minutes);
    return false;
  }
  
  Wire.beginTransmission(PI_PICO_I2C_ADDRESS);
  Wire.write(CMD_SET_WAKEUP);
  Wire.write((minutes >> 24) & 0xFF);
  Wire.write((minutes >> 16) & 0xFF);
  Wire.write((minutes >> 8) & 0xFF);
  Wire.write(minutes & 0xFF);
  uint8_t error = Wire.endTransmission();
  
  if (error != 0) {
    Serial.printf("Failed to send wakeup set command, error: %d\n", error);
    return false;
  }
  
  delay(100); // Give Pi Pico time to process
  
  // Check response
  Wire.requestFrom(PI_PICO_I2C_ADDRESS, 1);
  if (Wire.available()) {
    uint8_t response = Wire.read();
    if (response == 0x82) {
      Serial.printf("✓ Wakeup interval successfully set to %lu minutes\n", minutes);
      return true;
    } else if (response == 0x83) {
      Serial.printf("Pi Pico rejected wakeup interval: %lu minutes\n", minutes);
      return false;
    } else {
      Serial.printf("Unexpected response from Pi Pico: 0x%02X\n", response);
      return false;
    }
  } else {
    Serial.printf("No response from Pi Pico for set wakeup command\n");
    return false;
  }
}

