FloThinksPi/PhotoPainter-ESP32/src/fetcher.cpp
</script></body></html>)";
}

// ========================================
// FIRMWARE UPDATE FUNCTIONS
// ========================================

void handleFirmwareUpdate() {
  if (!checkAuthentication()) {
    server.send(401, "text/html; charset=utf-8", getLoginPage());
    return;
  }
  
  HTTPUpload& upload = server.upload();
  
  if (upload.status == UPLOAD_FILE_START) {
    Serial.printf("Firmware update started: %s\n", upload.filename.c_str());
    
    if (!Update.begin(UPDATE_SIZE_UNKNOWN)) {
      Update.printError(Serial);
      server.send(500, "text/plain", "Update failed to start");
      return;
    }
  } 
  else if (upload.status == UPLOAD_FILE_WRITE) {
    if (Update.write(upload.buf, upload.currentSize) != upload.currentSize) {
      Update.printError(Serial);
      server.send(500, "text/plain", "Update write failed");
      return;
    }
  } 
  else if (upload.status == UPLOAD_FILE_END) {
    if (Update.end(true)) {
      Serial.printf("Firmware update success: %u bytes\n", upload.totalSize);
      server.send(200, "text/plain", "Update successful! Device will restart in 3 seconds.");
      delay(3000);
      ESP.restart();
    } else {
      Update.printError(Serial);
      server.send(500, "text/plain", "Update failed to complete");
    }
  }
}

// ========================================
// URL MANAGEMENT FUNCTIONS
// ========================================

// Initialize battery data from persistent storage with wear leveling
void initBatteryData() {
  Serial.println("Initializing battery data from persistent storage...");
  
  // Load display cycle count from wear-leveled namespace
  String namespace_base = "pf";
  uint32_t highest_cycle = 0;
  String active_namespace = "pf0"; // Default
  
  // Find the most recent namespace (same as URL storage)
  for (int ns = 0; ns < 8; ns++) {
    String test_namespace = namespace_base + String(ns);
    preferences.begin(test_namespace.c_str(), true); // Read-only
    
    uint32_t cycle = preferences.getInt("writeCycle", 0);
    if (cycle > 0 && cycle > highest_cycle) {
      highest_cycle = cycle;
      active_namespace = test_namespace;
    }
    preferences.end();
  }
  
  // Load battery data from active namespace
  preferences.begin(active_namespace.c_str(), false);
  display_cycle_count = preferences.getUInt("displayCycles", 0);
  uint8_t last_charging_state = preferences.getUChar("lastCharging", 3);
  
  // Load last known good battery voltage (fallback if I2C fails)
  float last_known_voltage = preferences.getFloat("lastVoltage", 3.7f);
  preferences.end();
  
  Serial.printf("✓ Loaded battery data: %d display cycles, last charging state: %d, last voltage: %.3fV\n", 
               display_cycle_count, last_charging_state, last_known_voltage);
  
  // Try to get current battery values from hardware
  Serial.println("Attempting to get current battery status from Pi Pico...");
  current_battery_voltage = getBatteryVoltage();
  current_charging_status = getChargingStatus();
  
  // If I2C communication failed, use last known values but mark as stale
  if (current_battery_voltage < 0) {
    Serial.printf("⚠ I2C communication failed - using last known voltage: %.3fV\n", last_known_voltage);
    current_battery_voltage = last_known_voltage;
  } else {
    // Save successful reading for future use
    preferences.begin(active_namespace.c_str(), false);
    preferences.putFloat("lastVoltage", current_battery_voltage);
    preferences.end();
  }
  
  // Check if we just transitioned to full charge (reset cycles)
  if (last_charging_state != 2 && current_charging_status == 2) {
    Serial.println("🔋 Battery just completed charging - resetting cycle count");
    display_cycle_count = 0;
    saveBatteryData();
  }
  
  int battery_percentage = calculateBatteryPercentage(current_battery_voltage);
  Serial.printf("✓ Battery initialization complete: %.3fV, %d%%, %d cycles\n", 
               current_battery_voltage, battery_percentage, display_cycle_count);
  
  if (current_battery_voltage < 0) {
    Serial.println("⚠ Warning: Battery monitoring may be unreliable due to I2C communication issues");
    Serial.println("  → Check Pi Pico connection and ensure it's running properly");
  }
}

// Save battery data to persistent storage with wear leveling
void saveBatteryData() {
  // Use same wear leveling as URL storage
  String namespace_base = "pf";
  uint32_t current_cycle = write_cycle_counter;
  String active_namespace = namespace_base + String(current_cycle % 8);
  
  preferences.begin(active_namespace.c_str(), false);
  preferences.putUInt("displayCycles", display_cycle_count);
  preferences.putUChar("lastCharging", current_charging_status);
  
  // Save last known voltage if valid
  if (current_battery_voltage > 0) {
    preferences.putFloat("lastVoltage", current_battery_voltage);
  }
  preferences.end();
  
  Serial.printf("Saved battery data to %s: %d cycles, charging state %d, voltage %.3fV\n", 
               active_namespace.c_str(), display_cycle_count, current_charging_status, current_battery_voltage);
}

// Initialize URL storage and load existing URLs with wear leveling support
void initUrlStorage() {
  Serial.println("Initializing wear-leveled URL storage...");
  
  // FLASH WEAR LEVELING: Find the most recent namespace with valid data
  String namespace_base = "pf";
  uint32_t highest_cycle = 0;
  String active_namespace = "photoframe"; // Fallback to old namespace
  bool found_wear_leveled = false;
  
  // Check all 8 wear-leveling namespaces to find the newest one
  for (int ns = 0; ns < 8; ns++) {
    String test_namespace = namespace_base + String(ns);
    preferences.begin(test_namespace.c_str(), true); // Read-only
    
    uint32_t cycle = preferences.getInt("writeCycle", 0);
    if (cycle > 0 && cycle > highest_cycle) {
      highest_cycle = cycle;
      active_namespace = test_namespace;
      found_wear_leveled = true;
    }
    preferences.end();
  }
  
  if (found_wear_leveled) {
    write_cycle_counter = highest_cycle;
    Serial.printf("Found wear-leveled data in namespace: %s (cycle %d)\n", active_namespace.c_str(), highest_cycle);
  } else {
    // Check old "photoframe" namespace for migration
    preferences.begin("photoframe", true);
    int old_count = preferences.getInt("urlCount", 0);
    preferences.end();
    
