FloThinksPi/PhotoPainter-ESP32/src/fetcher.cpp
// Get the current URL and advance to next with wear leveling
String getCurrentUrlAndAdvance() {
  if (urlCount == 0) {
    return "";
  }
  
  String currentUrl = imageUrls[currentUrlIndex];
  
  // Advance to next URL
  currentUrlIndex = (currentUrlIndex + 1) % urlCount;
  
  // FLASH WEAR LEVELING: Save with distributed writes instead of direct preferences.putInt
  saveUrls(); // This uses wear leveling to save current index along with URLs
  
  Serial.printf("Using URL %d/%d: %s\n", (currentUrlIndex == 0 ? urlCount : currentUrlIndex), urlCount, currentUrl.c_str());
  Serial.printf("Next URL will be index %d\n", currentUrlIndex);
  
  return currentUrl;
}

// Add a new URL
bool addUrl(const String& url) {
  if (urlCount >= MAX_URLS) {
    Serial.println("Cannot add URL - maximum reached");
    return false;
  }
  
  if (url.length() > MAX_URL_LENGTH) {
    Serial.println("Cannot add URL - too long");
    return false;
  }
  
  // Check if URL already exists
  for (int i = 0; i < urlCount; i++) {
    if (imageUrls[i].equals(url)) {
      Serial.println("URL already exists");
      return false;
    }
  }
  
  imageUrls[urlCount] = url;
  urlCount++;
  saveUrls();
  
  Serial.printf("✓ Added URL %d: %s\n", urlCount, url.c_str());
  return true;
}

// Remove a URL by index
bool removeUrl(int index) {
  if (index < 0 || index >= urlCount) {
    return false;
  }
  
  // Shift remaining URLs down
  for (int i = index; i < urlCount - 1; i++) {
    imageUrls[i] = imageUrls[i + 1];
  }
  
  urlCount--;
  
  // Adjust current index if needed
  if (currentUrlIndex >= urlCount && urlCount > 0) {
    currentUrlIndex = 0;
  }
  
  saveUrls();
  
  Serial.printf("✓ Removed URL at index %d, %d URLs remaining\n", index, urlCount);
  return true;
}

// HTML for the web UI
const char* getWebUI() {
  static String html; // Use String instead of fixed buffer to avoid truncation
  
  // Generate URL list HTML
  String urlListHtml = "";
  for (int i = 0; i < urlCount; i++) {
    bool isCurrent = (i == currentUrlIndex); // Check if this is the current URL
    urlListHtml += "<div class=\"url-item" + String(isCurrent ? " current" : "") + "\">";
    urlListHtml += "<div class=\"url-idx" + String(isCurrent ? " current" : "") + "\">" + String(i + 1) + "</div>";
    if (isCurrent) {
      urlListHtml += "<div class=\"url-current\">ACTIVE</div>";
    }
    urlListHtml += "<div class=\"url-text\">" + imageUrls[i] + "</div>";
    urlListHtml += "<div class=\"url-controls\">";
    urlListHtml += "<button class=\"display-single\" onclick=\"displayImage(" + String(i) + ")\">&#128444;</button>";
    urlListHtml += "<button class=\"del\" onclick=\"deleteUrl(" + String(i) + ")\">&#128465;</button>";
    urlListHtml += "</div>";
    urlListHtml += "</div>";
  }
  
  // Get IP address string safely
  String ipAddress = WiFi.localIP().toString();
  
  html = "<!DOCTYPE html><html><head><meta charset=\"UTF-8\"><title>PhotoFrame Control Panel</title><meta name=\"viewport\" content=\"width=device-width,initial-scale=1\">";
  html += "<style>";
  html += "body{font-family:Arial;margin:20px;background:#f0f0f0}";
  html += ".c{max-width:900px;margin:0 auto;background:white;padding:20px;border-radius:10px}";
  html += "h1{color:#333;text-align:center;border-bottom:2px solid #4CAF50;padding-bottom:10px}";
  html += "h2{color:#333;border-bottom:1px solid #ddd;padding-bottom:5px}";
  html += ".card{background:#e8f5e8;padding:15px;border-radius:8px;margin:15px 0;border-left:4px solid #4CAF50}";
  html += ".i{margin:10px 0}";
  html += ".good{color:#4CAF50;font-weight:bold}.low{color:#FF9800;font-weight:bold}.crit{color:#f44336;font-weight:bold}";
  html += ".f{margin:15px 0}";
  html += "input{width:100%;padding:10px;border:2px solid #ddd;border-radius:5px;font-size:14px;box-sizing:border-box}";
  html += "button{padding:10px 15px;border:none;border-radius:5px;cursor:pointer;font-size:14px;margin:5px 5px 5px 0;background:#4CAF50;color:white;transition:all 0.3s}";
  html += ".logout{background:#FF9800;float:right}.del{background:#f44336;padding:8px 12px;font-size:12px}.add{background:#2196F3}.display{background:#9C27B0}.next{background:#FF5722}.display-single{background:#4CAF50;padding:8px 12px;font-size:12px}";
  html += "button:hover{opacity:0.8;transform:translateY(-1px)}";
  html += ".url-item{background:#fff;padding:15px;margin:8px 0;border:2px solid #ddd;border-radius:8px;display:flex;align-items:center;transition:all 0.3s}";
  html += ".url-item:hover{border-color:#4CAF50;box-shadow:0 2px 8px rgba(0,0,0,0.1)}";
  html += ".url-item.current{border-color:#4CAF50;background:#f8fff8;box-shadow:0 2px 8px rgba(76,175,80,0.2)}";
  html += ".url-idx{background:#666;color:white;border-radius:50%;width:30px;height:30px;display:flex;align-items:center;justify-content:center;font-weight:bold;margin-right:15px}";
  html += ".url-idx.current{background:#4CAF50}";
  html += ".url-current{color:#4CAF50;font-weight:bold;font-size:11px;margin:0 10px;padding:2px 8px;background:#e8f5e8;border-radius:12px}";
  html += ".url-text{flex:1;font-family:monospace;font-size:13px;word-break:break-all;margin-right:15px;line-height:1.4}";
  html += ".url-controls{display:flex;gap:5px}";
  html += ".control-section{background:#f3e5f5;padding:15px;border-radius:8px;margin:15px 0;border-left:4px solid #9C27B0}";
  html += ".sec{background:#fff3e0;padding:15px;border-radius:8px;margin:15px 0;border-left:4px solid #FF9800}";
  html += ".up{background:#e3f2fd;padding:15px;border-radius:8px;margin:15px 0;border-left:4px solid #2196F3}";
  html += ".status-msg{padding:10px;margin:10px 0;border-radius:5px;font-weight:bold}";
  html += ".status-success{background:#d4edda;color:#155724;border:1px solid #c3e6cb}";
  html += ".status-error{background:#f8d7da;color:#721c24;border:1px solid #f5c6cb}";
  html += "</style></head><body><div class=\"c\">";
  
  html += "<h1>&#128248; PhotoFrame Control Panel</h1><button class=\"logout\" onclick=\"logout()\">Logout</button>";
  html += "<div class=\"card\"><h2>&#128202; System Status</h2>";
  
  // Enhanced battery status with percentage and cycle count
  int battery_percentage = calculateBatteryPercentage(current_battery_voltage);
  String battery_color = (current_battery_voltage > 3.5f) ? "good" : (current_battery_voltage > 3.2f) ? "low" : "crit";
  String percentage_indicator = "";
  
