FloThinksPi/PhotoPainter-ESP32/src/fetcher.cpp
  return html.c_str();
}

// Web server handlers
void handleRoot() {
  if (!checkAuthentication()) {
    server.send(200, "text/html; charset=utf-8", getLoginPage());
    return;
  }
  
  // Update status from Pi Pico
  current_battery_voltage = getBatteryVoltage();
  current_wakeup_interval = getWakeupInterval();
  current_charging_status = getChargingStatus();
  
  // Send battery info to display for overlay
  if (current_battery_voltage > 0.0f) {
    sendBatteryInfoToDisplay(current_battery_voltage, display_cycle_count);
  }
  
  last_status_update = millis();
  
  server.send(200, "text/html; charset=utf-8", getWebUI());
}

void handleSetWakeup() {
  if (!checkAuthentication()) {
    server.send(401, "text/html; charset=utf-8", getLoginPage());
    return;
  }
  
  if (server.hasArg("minutes")) {
    uint32_t minutes = server.arg("minutes").toInt();
    
    if (setWakeupInterval(minutes)) {
      current_wakeup_interval = minutes;
      server.send(200, "text/plain", "Wakeup interval updated successfully!");
    } else {
      server.send(400, "text/plain", "Failed to update wakeup interval");
    }
  } else {
    server.send(400, "text/plain", "Missing minutes parameter");
  }
}

void handleAddUrl() {
  if (!checkAuthentication()) {
    server.send(401, "text/html; charset=utf-8", getLoginPage());
    return;
  }
  
  if (server.hasArg("url")) {
    String url = server.arg("url");
    
    if (addUrl(url)) {
      server.send(200, "text/plain", "URL added successfully!");
    } else {
      server.send(400, "text/plain", "Failed to add URL (duplicate, too long, or maximum reached)");
    }
  } else {
    server.send(400, "text/plain", "Missing URL parameter");
  }
}

void handleDeleteUrl() {
  if (!checkAuthentication()) {
    server.send(401, "text/html; charset=utf-8", getLoginPage());
    return;
  }
  
  if (server.hasArg("index")) {
    int index = server.arg("index").toInt();
    
    if (removeUrl(index)) {
      server.send(200, "text/plain", "URL deleted successfully!");
    } else {
      server.send(400, "text/plain", "Failed to delete URL (invalid index)");
    }
  } else {
    server.send(400, "text/plain", "Missing index parameter");
  }
}

void handleChangePassword() {
  if (!checkAuthentication()) {
    server.send(401, "text/html; charset=utf-8", getLoginPage());
    return;
  }
  
  if (server.hasArg("password")) {
    String newPassword = server.arg("password");
    
    if (newPassword.length() >= 8) {
      adminPassword = newPassword;
      saveAdminSettings(); // Use wear-leveled storage
      
      server.send(200, "text/plain", "Password changed successfully!");
      Serial.println("Admin password updated with wear leveling");
    } else {
      server.send(400, "text/plain", "Password must be at least 8 characters long");
    }
  } else {
    server.send(400, "text/plain", "Missing password parameter");
  }
}

void handleDisplayCurrent() {
  if (!checkAuthentication()) {
    server.send(401, "text/plain", "Unauthorized");
    return;
  }
  
  last_status_update = millis();
  
  if (urlCount > 0) {
    Serial.println("🖼️ Manual display request - displaying current image");
    
    bool success = downloadAndConvertBmpImage(imageUrls[currentUrlIndex].c_str());
    
    if (success) {
      server.send(200, "text/plain", "✓ Displaying current image: " + imageUrls[currentUrlIndex]);
    } else {
      server.send(500, "text/plain", "❌ Failed to display image: " + imageUrls[currentUrlIndex]);
    }
  } else {
    server.send(400, "text/plain", "❌ No URLs configured");
  }
}

void handleDisplayImage() {
  if (!checkAuthentication()) {
    server.send(401, "text/plain", "Unauthorized");
    return;
  }
  
  if (!server.hasArg("index")) {
    server.send(400, "text/plain", "❌ Missing index parameter");
    return;
  }
  
  int index = server.arg("index").toInt();
  
  if (index < 0 || index >= urlCount) {
    server.send(400, "text/plain", "❌ Invalid URL index: " + String(index));
    return;
  }
  
  last_status_update = millis();
  
  Serial.printf("🖼️ Manual display request - showing image %d/%d\n", index + 1, urlCount);
  
  bool success = downloadAndConvertBmpImage(imageUrls[index].c_str());
  
  if (success) {
    // Update current index to the displayed image with wear leveling
    currentUrlIndex = index;
    saveUrls(); // Use wear-leveled storage instead of direct write
    
    server.send(200, "text/plain", "✓ Displaying image " + String(index + 1) + "/" + String(urlCount) + ": " + imageUrls[index]);
  } else {
    server.send(500, "text/plain", "❌ Failed to display image " + String(index + 1) + ": " + imageUrls[index]);
  }
}

void handleNextImage() {
  if (!checkAuthentication()) {
    server.send(401, "text/plain", "Unauthorized");
    return;
  }
  
  last_status_update = millis();
  
  if (urlCount > 0) {
    // Advance to next URL
    currentUrlIndex = (currentUrlIndex + 1) % urlCount;
    
    // Save current index with wear leveling
    saveUrls(); // Use wear-leveled storage instead of direct write
    
    Serial.printf("⏭️ Manual next image - advancing to URL %d/%d\n", currentUrlIndex + 1, urlCount);
    
    bool success = downloadAndConvertBmpImage(imageUrls[currentUrlIndex].c_str());
    
    if (success) {
      server.send(200, "text/plain", "✓ Loading next image (" + String(currentUrlIndex + 1) + "/" + String(urlCount) + "): " + imageUrls[currentUrlIndex]);
    } else {
      server.send(500, "text/plain", "❌ Failed to load next image: " + imageUrls[currentUrlIndex]);
    }
  } else {
    server.send(400, "text/plain", "❌ No URLs configured");
  }
}

void handleNotFound() {
  server.send(404, "text/plain", "Page not found");
}

// Initialize web server
void setupWebServer() {
  server.on("/", handleRoot);
  server.on("/login", HTTP_POST, handleLogin);
  server.on("/logout", HTTP_POST, handleLogout);
  server.on("/setWakeup", HTTP_POST, handleSetWakeup);
  server.on("/addUrl", HTTP_POST, handleAddUrl);
  server.on("/deleteUrl", HTTP_POST, handleDeleteUrl);
  server.on("/displayCurrent", HTTP_POST, handleDisplayCurrent);
  server.on("/displayImage", HTTP_POST, handleDisplayImage);
  server.on("/nextImage", HTTP_POST, handleNextImage);
  server.on("/changePassword", HTTP_POST, handleChangePassword);
  server.on("/firmware", HTTP_POST, []() {
    server.send(200, "text/plain", "");
  }, handleFirmwareUpdate);
  server.onNotFound(handleNotFound);
  
  server.begin();
  Serial.println("✓ Web server started on port 80");
  Serial.printf("✓ Access control panel at: http://%s\n", WiFi.localIP().toString().c_str());
}

void setup() {
  Serial.begin(115200);
  Serial.println("=== ESP32 I2C IMAGE FETCHER ===");
  
  // Display ESP32 hardware information
  printESP32ModelInfo();
  
  // Initialize URL storage first
  initUrlStorage();
  
