FloThinksPi/PhotoPainter-ESP32/src/fetcher.cpp
  // Initialize I2C communication first to check charging status
  Serial.println("Initializing I2C for charging status check...");
  if (!initI2C()) {
    Serial.println("FATAL: I2C initialization failed!");
  }
  
  // Wait for Pi Pico to fully initialize I2C slave
  Serial.println("Waiting for Pi Pico I2C slave to initialize...");
  delay(2000); // 2 second startup delay for reliable I2C communication
  Serial.println("✓ I2C slave initialization period complete");
  
  // Check charging status to determine WiFi behavior
  uint8_t charging_status = getChargingStatus();
  current_charging_status = charging_status;
  
  bool should_enable_wifi = false;
  
  if (charging_status == 1 || charging_status == 2) {
    // Charging or charge complete - enable WiFi services
    Serial.println("🔌 Device is charging/charged - enabling WiFi configuration services");
    should_enable_wifi = true;
  } else {
    // No external power or not charging - battery mode only
    Serial.println("🔋 Battery mode detected - skipping WiFi to save power");
    Serial.println("WiFi config portal and web server will be disabled to maximize battery life");
    should_enable_wifi = false;
  }
  
  // WiFi initialization based on charging status
  if (should_enable_wifi) {
    Serial.println("Initializing WiFi Manager (CHARGING MODE - full features enabled)...");
    
    // Start with low power mode during connection setup for efficiency
    setWiFiLowPowerMode();
    
    wm.setBreakAfterConfig(true);
    wm.setConfigPortalTimeout(1800); // 30 minutes timeout for config portal when charging
    wm.setConnectTimeout(30); // 30s connection timeout
    wm.setConfigPortalBlocking(false);
    wm.setSaveConfigCallback([]() {
      Serial.println("WiFi config saved - immediate restart");
    });
    
    if (!wm.autoConnect("ESP32PhotoFrame", "photoframe123")) {
      Serial.println("WiFi connection failed after 30s - but staying in charging mode");
      Serial.println("Configuration portal may be available for setup");
    } else {
      Serial.println("✓ WiFi connected successfully");
      Serial.printf("IP address: %s\n", WiFi.localIP().toString().c_str());
      
      // Print ESP32 model information on startup
      printESP32ModelInfo();
      
      // Switch to performance mode for web server operations when charging
      Serial.println("🔌 CHARGING MODE: Switching to WiFi performance mode for web server");
      setWiFiPerformanceMode();
      WiFi.setAutoReconnect(true);
      WiFi.persistent(true);
      Serial.println("✓ WiFi optimizations enabled for charging mode");
      
      // Initialize web server for configuration
      setupWebServer();
    }
  } else {
    // Battery mode - attempt quick WiFi connection only
    Serial.println("Attempting quick WiFi connection (BATTERY MODE - 10s timeout)...");
    
    // Start with low power mode for efficient connection in battery mode
    setWiFiLowPowerMode();
    
    wm.setConnectTimeout(10); // Very short timeout for battery mode
    wm.setConfigPortalTimeout(0); // Disable config portal
    wm.setConfigPortalBlocking(false);
    
    if (wm.autoConnect("ESP32PhotoFrame", "photoframe123")) {
      Serial.println("✓ Quick WiFi connection successful");
      Serial.printf("IP address: %s\n", WiFi.localIP().toString().c_str());
      
      // Keep low power mode active for battery conservation
      Serial.println("🔋 BATTERY MODE: Maintaining WiFi low power mode for energy efficiency");
      // Low power mode already set above, just maintain it
    } else {
      Serial.println("❌ Quick WiFi connection failed - entering deep sleep mode");
      Serial.println("💤 Putting renderer to sleep and entering ESP32 deep sleep");
      
      // Put renderer to sleep before ESP32 sleeps
      if (putRendererToSleep()) {
        Serial.println("✓ Renderer sleep command sent successfully");
      } else {
        Serial.println("⚠ Failed to send renderer sleep command, proceeding with ESP32 sleep");
      }
      
      delay(1000); // Give renderer time to process sleep command
      
      // Put ESP32 into deep sleep
      Serial.println("💤 ESP32 entering deep sleep - both devices will be off");
      Serial.flush();
      delay(100);
      
      WiFi.disconnect(true);
      WiFi.mode(WIFI_OFF);
      esp_deep_sleep_start(); // Sleep indefinitely until reset
    }
  }

  Serial.println("===================");
  Serial.printf("Power efficiency mode: MAXIMUM\n");
  Serial.printf("Free heap: available\n");
  Serial.printf("Image data size: %d bytes\n", sizeof(Image7color));
  
  // Initialize I2C communication with fastest settings
  if (!initI2C()) {
    Serial.println("FATAL: I2C initialization failed!");
  }
  
  // Wait for Pi Pico to fully initialize I2C slave
  Serial.println("Waiting for Pi Pico I2C slave to initialize...");
  delay(2000); // 2 second startup delay for reliable I2C communication
  Serial.println("✓ I2C slave initialization period complete");
  
  // Perform I2C bus scan to check for devices
  Serial.println("=== I2C BUS SCAN ===");
  Serial.println("Scanning for I2C devices...");
  
  int deviceCount = 0;
  for (uint8_t address = 1; address < 127; address++) {
    Wire.beginTransmission(address);
    uint8_t error = Wire.endTransmission();
    
    if (error == 0) {
      Serial.printf("✓ I2C device found at address 0x%02X\n", address);
      deviceCount++;
      
      if (address == PI_PICO_I2C_ADDRESS) {
        Serial.printf("✓ CONFIRMED: Pi Pico found at expected address 0x%02X\n", address);
      }
    } else if (error == 4) {
      Serial.printf("✗ Unknown error at address 0x%02X\n", address);
    }
  }
  
  if (deviceCount == 0) {
    Serial.println("✗ NO I2C DEVICES FOUND!");
    Serial.println("This indicates:");
    Serial.println("  1. Pi Pico is not powered or not running");
    Serial.println("  2. I2C wiring issues (SDA/SCL swapped or disconnected)");
    Serial.println("  3. Pi Pico I2C slave code not running");
    Serial.println("  4. Wrong I2C address in Pi Pico code");
  } else {
    Serial.printf("✓ Found %d I2C device(s)\n", deviceCount);
    
