FloThinksPi/PhotoPainter-ESP32/src/fetcher.cpp
    if (deviceCount > 0) {
      // Test communication with our expected device
      Serial.printf("Testing communication with Pi Pico at 0x%02X...\n", PI_PICO_I2C_ADDRESS);
      
      Wire.beginTransmission(PI_PICO_I2C_ADDRESS);
      uint8_t testError = Wire.endTransmission();
      
      if (testError == 0) {
        Serial.println("✓ Pi Pico responds to address!");
      } else {
        Serial.printf("✗ Pi Pico does not respond (error: %d)\n", testError);
        if (testError == 2) {
          Serial.println("  → NACK on address - Pi Pico not at this address");
        } else if (testError == 5) {
          Serial.println("  → Timeout - Pi Pico may be busy or address wrong");
        }
      }
    }
  }

  Serial.println("=== ESP32 I2C Master Ready===");
  
  // Initialize battery data now that I2C is ready
  initBatteryData();
  
  // Auto-fetch first image on boot if URLs are configured
  autoFetchOnBoot();
}

// Auto-fetch functionality that runs once on boot after WiFi/I2C initialization
void autoFetchOnBoot() {
  Serial.println("=== AUTO-FETCH ON BOOT ===");
  unsigned long auto_fetch_start = millis();
  
  if (urlCount == 0) {
    Serial.println("No URLs configured - skipping auto-fetch");
    Serial.println("Add URLs via web interface or use default image");
    return;
  }
  
  if (!WiFi.isConnected()) {
    Serial.println("WiFi not connected - skipping auto-fetch");
    return;
  }
  
  Serial.printf("🚀 Auto-fetching image on boot: %s\n", getCurrentUrlAndAdvance().c_str());
  Serial.println("This will download and display the next image automatically...");
  
  // Test I2C connection before attempting transfer
  unsigned long i2c_test_start = millis();
  if (!testI2CConnection()) {
    Serial.println("❌ I2C connection test failed - cannot transfer image to renderer");
    Serial.println("Skipping auto-fetch due to I2C issues");
    return;
  }
  unsigned long i2c_test_time = millis() - i2c_test_start;
  Serial.printf("⏱️ I2C connection test: %lu ms\n", i2c_test_time);
  
  // Attempt to download and display the current image
  String currentUrl = getCurrentUrlAndAdvance();
  unsigned long download_start = millis();
  bool success = downloadAndConvertBmpImage(currentUrl.c_str());
  unsigned long download_time = millis() - download_start;
  Serial.printf("⏱️ Total download and transfer time: %lu ms (%.2f seconds)\n", download_time, download_time / 1000.0);
  
  if (success) {
    Serial.println("✅ Auto-fetch completed successfully!");
    Serial.println("Image should now be displaying on the e-paper screen");
    
    // Get and display battery info after successful display
    unsigned long battery_start = millis();
    float voltage = getBatteryVoltage();
    if (voltage > 0) {
      sendBatteryInfoToDisplay(voltage, display_cycle_count);
      Serial.printf("🔋 Battery status sent: %.2fV, %u cycles\n", voltage, display_cycle_count);
    }
    unsigned long battery_time = millis() - battery_start;
    Serial.printf("⏱️ Battery info update: %lu ms\n", battery_time);
  } else {
    Serial.println("❌ Auto-fetch failed - check URL and network connection");
  }
  
  unsigned long total_time = millis() - auto_fetch_start;
  Serial.printf("⏱️ TOTAL AUTO-FETCH TIME: %lu ms (%.2f seconds)\n", total_time, total_time / 1000.0);
  Serial.println("=== AUTO-FETCH COMPLETE ===");
}

// Download and stream image directly to Pi Pico with MAXIMUM SPEED
bool downloadAndStreamImage(const char* url) {
  Serial.printf("Starting streaming download from: %s\n", url);
  
  HTTPClient http;
  http.begin(url);
  http.setFollowRedirects(HTTPC_STRICT_FOLLOW_REDIRECTS);
  http.setTimeout(5000); // BALANCED: 5s timeout for reliable downloads
  http.setConnectTimeout(2000); // 2s connection timeout for reliable connection
  http.setReuse(false); // Don't reuse connections for faster cleanup
  
  int httpCode = http.GET();
  
  if (httpCode > 0) {
    Serial.printf("HTTP response code: %d\n", httpCode);
    
    if (httpCode == HTTP_CODE_OK) {
      int contentLength = http.getSize();
      Serial.printf("Content length: %d bytes\n", contentLength);
      
      WiFiClient* stream = http.getStreamPtr();
      size_t bytesRead = 0;
      uint32_t chunk_id = 0;
      unsigned long start_time = millis(); // For transfer speed calculation

      Serial.printf("Streaming %d bytes in chunks...\n", contentLength);

      while (http.connected() && bytesRead < contentLength) {
        size_t available = stream->available();
        if (available) {
          // Read larger chunks using our dedicated streaming buffer
          size_t toRead = min(available, (size_t)STREAM_BUFFER_SIZE);
          toRead = min(toRead, (size_t)(contentLength - bytesRead));
          
          size_t readSize = stream->readBytes(stream_buffer, toRead);
          
          if (readSize > 0) {
            // Split large buffer into I2C chunks and send immediately
            size_t bytes_processed = 0;
            while (bytes_processed < readSize) {
              size_t chunk_size = min((size_t)I2C_CHUNK_SIZE, readSize - bytes_processed);
              
              // Send this chunk via I2C immediately  
              if (!sendImageChunk(chunk_id, &stream_buffer[bytes_processed], chunk_size)) {
                Serial.printf("✗ Failed to send streaming chunk %d\n", chunk_id);
                http.end();
                return false;
              }
              
              chunk_id++;
              bytes_processed += chunk_size;
            }
            
            bytesRead += readSize;
            
            // Progress reporting every 20KB for less verbosity but speed monitoring
            if (bytesRead % 20000 == 0) { // Every 20KB (was 10KB)
              float percent = ((float)bytesRead / contentLength) * 100.0;
              float kbps = (millis() > start_time) ? (bytesRead / (float)(millis() - start_time)) : 0;
              Serial.printf("Streaming: %d/%d bytes (%.1f%%, %.1f KB/s)\n", 
                           bytesRead, contentLength, percent, kbps);
            }
          
