FloThinksPi/PhotoPainter-ESP32/src/fetcher.cpp
      if (!work_buffer) {
        Serial.printf("✗ Failed to allocate work buffer (%d bytes)\n", work_buffer_size);
        if (palette_buffer) {
          free(palette_buffer);
        }
        http.end();
        return false;
      }
      
        Serial.printf("✓ Allocated MASSIVE SPEED work buffer: %d bytes (ULTIMATE parallel processing mode)\n", work_buffer_size);      // Process BMP pixel data in display order for optimal I2C efficiency
      // SIMPLIFIED: Stream BMP data sequentially, renderer will handle reordering
      uint32_t work_buffer_pos = 0;
      
      // Allocate a buffer for one BMP row for reordering
      const uint32_t bmp_row_bytes = (infoHeader.biBitCount == 8) ? infoHeader.biWidth : infoHeader.biWidth * 3;
      const uint32_t bmp_row_padding = (4 - (bmp_row_bytes % 4)) % 4;
      const uint32_t bmp_row_total = bmp_row_bytes + bmp_row_padding;
      uint8_t* bmp_row_buffer = (uint8_t*)malloc(bmp_row_total);
      
      if (!bmp_row_buffer) {
        Serial.printf("✗ Failed to allocate BMP row buffer (%d bytes)\n", bmp_row_total);
        free(work_buffer);
        if (palette_buffer) {
          free(palette_buffer);
        }
        http.end();
        return false;
      }
      
      Serial.printf("✓ Allocated BMP row buffer: %d bytes\n", bmp_row_total);
      
      // ESP32 MEMORY MONITORING: Show heap usage after massive buffer allocation
      uint32_t heap_after_buffers = ESP.getFreeHeap();
      uint32_t buffer_memory_used = heap_before_buffers - heap_after_buffers;
      Serial.printf("🧠 Free heap after MASSIVE buffers: %d bytes (%.1f KB)\n", 
                   heap_after_buffers, heap_after_buffers / 1024.0);
      Serial.printf("📊 Total buffer memory allocated: %d bytes (%.1f KB)\n", 
                   buffer_memory_used, buffer_memory_used / 1024.0);
      Serial.printf("💪 Memory efficiency: %.1f%% heap utilization\n", 
                   (float)buffer_memory_used * 100.0 / heap_before_buffers);
      
        // SIMPLIFIED APPROACH: Stream BMP data in natural order and let renderer reorder
        // This is much simpler and more reliable than trying to reorder during streaming
        
        // Stream the pixel data sequentially, converting colors as we go
        // The renderer will receive a "raw BMP buffer" that it can reorder as needed
        uint32_t bytes_streamed = 0;
        uint32_t total_bmp_pixels = infoHeader.biWidth * infoHeader.biHeight;
        
        Serial.printf("🚀 ESP32 Streaming BMP pixel data sequentially (%d pixels, %d bytes per row)...\n", 
                     total_bmp_pixels, bmp_row_total);
        
        // ESP32 HIGH-PRECISION streaming performance timing
        #ifdef ESP32_PERFORMANCE_OPTIMIZED
        int64_t streaming_start = esp_timer_get_time(); // Microsecond precision
        #else
        unsigned long streaming_start = millis();
        #endif
        
        // Process each BMP row (bottom-to-top as stored in BMP)
        for (int32_t bmp_row = 0; bmp_row < (int32_t)infoHeader.biHeight; bmp_row++) {
          // Read entire BMP row into buffer
          size_t row_read = 0;
          // ESP32 PERFORMANCE: Enhanced row timing with microsecond precision
          #ifdef ESP32_PERFORMANCE_OPTIMIZED
          int64_t row_start_time = esp_timer_get_time();
          const int64_t row_timeout_us = 800000; // 800ms in microseconds
          #else
          unsigned long row_start_time = millis();
          const unsigned long row_timeout = 800; // BALANCED: 800ms timeout for reliability with speed
          #endif
          
          #ifdef ESP32_PERFORMANCE_OPTIMIZED
          while (row_read < bmp_row_total && (esp_timer_get_time() - row_start_time) < row_timeout_us) {
          #else
          while (row_read < bmp_row_total && (millis() - row_start_time) < row_timeout) {
          #endif
            if (stream->available() > 0) {
              size_t available = stream->available();
              size_t to_read = min(available, bmp_row_total - row_read);
              to_read = min(to_read, (size_t)16384); // Read in 16KB chunks for MAXIMUM speed (was 1KB)
              size_t read_size = stream->readBytes(&bmp_row_buffer[row_read], to_read);
              
              if (read_size > 0) {
                row_read += read_size;
              }
            } else {
              delay(1); // Brief pause if no data available
            }
          }
          
          if (row_read < bmp_row_total) {
            Serial.printf("✗ Failed to read BMP row %d (got %d of %d bytes)\n", 
                         bmp_row, row_read, bmp_row_total);
            free(bmp_row_buffer);
            free(work_buffer);
            if (palette_buffer) {
              free(palette_buffer);
            }
            http.end();
            return false;
          }
          
          // OPTIMIZED: Convert this row's pixels to e-paper colors using lookup table
          for (uint32_t bmp_col = 0; bmp_col < infoHeader.biWidth; bmp_col += 2) {
            uint8_t pixel_left_color, pixel_right_color;
            
            // Extract left pixel using FAST lookup table
            if (infoHeader.biBitCount == 8) {
              uint8_t index = bmp_row_buffer[bmp_col];
              pixel_left_color = color_lookup[index]; // FAST: Direct lookup, no RGB conversion!
            } else {
              uint32_t pixel_offset = bmp_col * 3;
              if (pixel_offset + 2 < bmp_row_bytes) {
                pixel_left_color = rgbToEpaperColor(bmp_row_buffer[pixel_offset + 2], 
                                                  bmp_row_buffer[pixel_offset + 1], 
                                                  bmp_row_buffer[pixel_offset]);
              } else {
                pixel_left_color = EPD_7IN3F_WHITE;
              }
            }
            
            // Extract right pixel (if exists) using FAST lookup table
            if (bmp_col + 1 < infoHeader.biWidth) {
              if (infoHeader.biBitCount == 8) {
                uint8_t index = bmp_row_buffer[bmp_col + 1];
                pixel_right_color = color_lookup[index]; // FAST: Direct lookup, no RGB conversion!
              } else {
                uint32_t pixel_offset = (bmp_col + 1) * 3;
                if (pixel_offset + 2 < bmp_row_bytes) {
                  pixel_right_color = rgbToEpaperColor(bmp_row_buffer[pixel_offset + 2], 
                                                     bmp_row_buffer[pixel_offset + 1], 
                                                     bmp_row_buffer[pixel_offset]);
                } else {
                  pixel_right_color = EPD_7IN3F_WHITE;
                }
              }
            } else {
              pixel_right_color = EPD_7IN3F_WHITE;
            }
            
            // Pack into byte (left pixel high nibble, right pixel low nibble)
            uint8_t packed_byte = (pixel_left_color << 4) | pixel_right_color;
            
            // Add to work buffer
            work_buffer[work_buffer_pos++] = packed_byte;
            
            // OPTIMIZED: Send buffer when full using BURST MODE for maximum speed
            if (work_buffer_pos >= work_buffer_size) {
              // Send entire buffer in BURST MODE for maximum speed (4096 bytes via multiple I2C transactions)
              if (!sendImageChunkBurst(bytes_streamed, work_buffer, work_buffer_pos)) {
                Serial.printf("✗ Failed to send BMP chunk at offset %d\n", bytes_streamed);
                free(bmp_row_buffer);
                free(work_buffer);
                if (palette_buffer) {
                  free(palette_buffer);
                }
                http.end();
                return false;
              }
              
              bytes_streamed += work_buffer_pos;
              work_buffer_pos = 0;
              
              // REMOVED: Progress reporting to eliminate I/O overhead for maximum speed
              // if (bytes_streamed % 25000 == 0) { ... }
              
