FloThinksPi/PhotoPainter-ESP32/src/fetcher.cpp
      // Check if we got any response body for debugging
      if (http.getSize() > 0) {
        String response = http.getString();
        if (response.length() > 0 && response.length() < 500) {
          Serial.printf("   → Server response: %s\n", response.c_str());
        }
      }
    }
  } else {
    Serial.printf("✗ HTTP connection failed: %s\n", http.errorToString(httpCode).c_str());
    Serial.println("   → Check WiFi connection and URL validity.");
  }

  http.end();
  
  // ESP32 WIFI POWER OPTIMIZATION: Return to low power mode after failed download
  Serial.println("🔋 Restoring WiFi LOW POWER mode after download attempt");
  setWiFiLowPowerMode();
  
  return false;
}

void loop() {
  // Handle web server requests
  server.handleClient();
  
  static unsigned long lastImageSend = 0;
  static bool i2cWorking = false;
  static unsigned long lastI2CTest = 0;
  static bool powerModeChecked = false;
  static bool isChargingMode = false;
  unsigned long currentTime = millis();
  
  // Check charging status once at startup to determine operating mode
  if (!powerModeChecked) {
    uint8_t charging_status = getChargingStatus();
    current_charging_status = charging_status;
    
    if (charging_status == 1 || charging_status == 2) {
      // Charging or charge complete - web server only mode
      isChargingMode = true;
      Serial.println("🔌 CHARGING MODE: Power connected - running web server only (no automatic image updates)");
      Serial.println("📱 Use the web interface to manually control image display");
      Serial.printf("🌐 Access control panel at: http://%s\n", WiFi.localIP().toString().c_str());
    } else {
      // Battery mode - normal power-efficient operation
      isChargingMode = false;
      Serial.println("🔋 BATTERY MODE: No external power - will display image and enter deep sleep");
    }
    powerModeChecked = true;
  }
  
  // If in charging mode, only handle web server - no automatic image processing
  if (isChargingMode) {
    // Just run the web server and periodic status updates
    // Update status from Pi Pico periodically for web UI
    static unsigned long lastStatusUpdate = 0;
    if (currentTime - lastStatusUpdate > 30000) { // Every 30 seconds when charging
      float new_voltage = getBatteryVoltage();
      uint32_t new_interval = getWakeupInterval();
      uint8_t new_charging_status = getChargingStatus();
      
      if (new_voltage >= 0.0f) {
        current_battery_voltage = new_voltage;
        // Send battery info to display for overlay  
        sendBatteryInfoToDisplay(current_battery_voltage, display_cycle_count);
      }
      if (new_interval > 0) {
        current_wakeup_interval = new_interval;
      }
      current_charging_status = new_charging_status;
      
      lastStatusUpdate = currentTime;
    }
    
    // Simple heartbeat for charging mode
    static unsigned long lastHeartbeat = 0;
    if (currentTime - lastHeartbeat > 300000) { // Every 5 minutes when charging
      Serial.printf("🔌 CHARGING MODE: Web server active | Battery: %.2fV | Free heap: %u bytes\n", 
                    current_battery_voltage, ESP.getFreeHeap());
      lastHeartbeat = currentTime;
    }
    
    return; // Exit loop - no image processing in charging mode
  }
  
  // BATTERY MODE ONLY - Continue with original power-efficient behavior
  // Test I2C connection every 30 seconds if it's not working
  if (!i2cWorking && (currentTime - lastI2CTest > 30000)) {
    Serial.println("=== RETESTING I2C CONNECTION ===");
    i2cWorking = testI2CConnection();
    lastI2CTest = currentTime;
    
    if (!i2cWorking) {
      Serial.println("⚠ I2C still not working - skipping image transfer");
      Serial.println("CHECK:");
      Serial.println("  1. Is Pi Pico powered and running?");
      Serial.println("  2. Is renderer.cpp uploaded to Pi Pico?");
      Serial.println("  3. Are I2C wires connected: ESP32-21→Pico-4, ESP32-22→Pico-5?");
      Serial.println("  4. Is Pi Pico I2C address set to 0x42?");
      return; // Skip this loop iteration
    } else {
      Serial.println("✓ I2C connection restored!");
    }
  }
  
  // BATTERY MODE ONLY - Only proceed with image transfer if I2C is working
  // SINGLE-SHOT mode: Send image once, wait for completion, then shutdown for maximum power savings
  if (i2cWorking && lastImageSend == 0) { // Only run once for battery conservation
    Serial.println("🔋 BATTERY MODE: Single-shot power-efficient image transfer");
    
    // Check slave status first
    uint8_t status = getSlaveStatus();
    Serial.printf("Pi Pico status: 0x%02X\n", status);
    
    if (status == STATUS_READY || status == STATUS_ERROR) {
      // Get next URL from the cycling list
      String imageUrl = getCurrentUrlAndAdvance();
      
      if (imageUrl.length() == 0) {
        Serial.println("✗ No URLs configured - cannot download image");
        Serial.println("💤 Going to deep sleep - configure URLs via web interface when charging");
        
        // Put renderer to sleep and then ESP32
        if (putRendererToSleep()) {
          Serial.println("✓ Renderer sleep command sent successfully");
        }
        
        delay(1000);
        WiFi.disconnect(true);
        WiFi.mode(WIFI_OFF);
        esp_deep_sleep_start();
        return; // Should not reach here
      }
      
      Serial.printf("🔋 BATTERY MODE: Converting and streaming BMP from: %s\n", imageUrl.c_str());
      bool transfer_success = false;
      
      if (downloadAndConvertBmpImage(imageUrl.c_str())) {
        Serial.println("✓ BMP conversion and streaming completed successfully");
        
        // Wait for renderer to complete the display update
        if (waitForRenderCompletion(30000)) { // 30 second timeout
          Serial.println("✓ COMPLETE SUCCESS: Image transfer and rendering finished!");
          transfer_success = true;
        } else {
          Serial.println("⚠ Render completion timeout - may still be working");
        }
      } else {
        Serial.println("⚠ BMP conversion failed, trying static image as fallback");
        
        // Fallback to static image
        if (sendCompleteImage()) {
          Serial.println("✓ Fallback image transfer completed successfully");
          
          // Wait for renderer to complete the display update
          if (waitForRenderCompletion(30000)) { // 30 second timeout
            Serial.println("✓ COMPLETE SUCCESS: Fallback image transfer and rendering finished!");
            transfer_success = true;
          } else {
            Serial.println("⚠ Fallback render completion timeout - may still be working");
          }
        } else {
          Serial.println("✗ Even fallback image transfer failed");
        }
      }
      
      // BATTERY MODE: Always go to deep sleep after image transfer (ignore web server activity)
      if (transfer_success) {
        Serial.println("🔋 BATTERY MODE: Shutting down ESP32 after successful operation for maximum power savings");
        shutdownESP32(); // This function never returns
      } else {
        Serial.println("⚠ BATTERY MODE: Transfer had issues - attempting deep sleep anyway to save battery");
        
        // Put renderer to sleep and then ESP32
        if (putRendererToSleep()) {
          Serial.println("✓ Renderer sleep command sent successfully");
        }
        
        delay(1000);
        WiFi.disconnect(true);
        WiFi.mode(WIFI_OFF);
        esp_deep_sleep_start();
        return; // Should not reach here
      }
      
    } else {
      Serial.printf("🔋 BATTERY MODE: Slave not ready (status: 0x%02X) - will retry in next cycle\n", status);
    }
  }
  
  // Initial I2C test on first run (battery mode only)
  if (!i2cWorking && lastI2CTest == 0) {
    Serial.println("=== INITIAL I2C CONNECTION TEST (BATTERY MODE) ===");
    i2cWorking = testI2CConnection();
    lastI2CTest = currentTime;
  }
  
  // Check connection health periodically (reduced frequency for power efficiency)
  static unsigned long lastHealthCheck = 0;
  if (currentTime - lastHealthCheck > 20000) { // Every 20 seconds (was 10) for less overhead
    checkI2CConnectionHealth();
    lastHealthCheck = currentTime;
  }
  
  // Simple heartbeat (reduced frequency for power efficiency during standby)
  static unsigned long lastHeartbeat = 0;
  if (currentTime - lastHeartbeat > 120000) { // Every 120 seconds during standby
    Serial.printf("🔋 BATTERY MODE: I2C: %lu transactions, %lu errors\n", 
                  i2cTransactionCount, errorCount);
    if (lastImageSend == 0) {
      Serial.println("STATUS: Waiting for I2C to become ready for single-shot transfer");
    } else {
      Serial.println("STATUS: Single-shot transfer attempted");
    }
    lastHeartbeat = currentTime;
  }

}
